In [ ]:
#!pip install pymysql
#!pip install sqlalchemy

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass() # to get password if sql

········

In [ ]:
#print(password)

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM actor', engine)
data.head()
#data.last_name.unique()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

# 1. How many distinct (different) actors' last names are there?

In [4]:

data = pd.read_sql_query('SELECT count(distinct last_name) AS "DIFFERENT SURNAMES" FROM actor'                            
                         , engine)
data.head()

   DIFFERENT SURNAMES
0                 121

# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [5]:
data = pd.read_sql_query('SELECT *, CASE WHEN (weekday(rental_date) = 6) OR (weekday(rental_date) = 7) \
        then "weekend" ELSE "workday" END AS "day_type" FROM rental'                            
                         , engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

# 3.Get all films with ARMAGEDDON in the title.

In [21]:
data = pd.read_sql_query('SELECT title FROM film WHERE title LIKE "%%ARMAGEDDON%%"'                        
                         , engine)
data.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

# 4.Get 10 the longest films.

In [15]:
data = pd.read_sql_query('SELECT title, length from film ORDER BY length DESC'                        
                         , engine)
data.head(10)

                title  length
0       CHICAGO NORTH     185
1      CONTROL ANTHEM     185
2      DARN FORRESTER     185
3         GANGS PRIDE     185
4           HOME PITY     185
5       MUSCLE BRIGHT     185
6        POND SEATTLE     185
7  SOLDIERS EVOLUTION     185
8   SWEET BROTHERHOOD     185
9        WORST BANGER     185

# 5 How many films include Behind the Scenes content?

In [18]:
data = pd.read_sql_query('SELECT title, special_features from film WHERE special_features LIKE "%%Behind the Scenes%%"'                        
                         , engine)
data.head()

              title                           special_features
0  ACADEMY DINOSAUR           Deleted Scenes,Behind the Scenes
1  AFFAIR PREJUDICE             Commentaries,Behind the Scenes
2   ALAMO VIDEOTAPE             Commentaries,Behind the Scenes
3       ALI FOREVER           Deleted Scenes,Behind the Scenes
4    ALICE FANTASIA  Trailers,Deleted Scenes,Behind the Scenes

# 6.Which kind of movies (rating) have a mean duration of more than two hours?

In [27]:
data = pd.read_sql_query('SELECT rating, round(AVG(length),2) as "Mean_length" FROM film GROUP BY rating HAVING Mean_length >120 '                        
                         , engine)
data.head()

  rating  Mean_length
0  PG-13       120.44

# 7Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [28]:
data = pd.read_sql_query('SELECT title, length, RANK() OVER (ORDER BY length) AS ranking FROM film \
WHERE length > 0 AND NOT ISNULL(length)'                        
                         , engine)
data.head()

                 title  length  ranking
0         ALIEN CENTER      46        1
1            IRON MOON      46        1
2        KWAI HOMEWARD      46        1
3     LABYRINTH LEAGUE      46        1
4  RIDGEMONT SUBMARINE      46        1